InformationRegisters/ТабельУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТабельУчетаРабочегоВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОНачисленияхСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОНачисленияхСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТрудоваяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/НачисленияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияСотрудникам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПараметровНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыРасчетаЗП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВыработкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВыработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТрудоваяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_СтраховаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_РольПерсонала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_РолиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_ОказаниеУслуг</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасходМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасходМатериалов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасходФактический</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходНормативный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОплачиваетсяКлиентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Набор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормулыРасчетаЗаработнойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ФормулыРасчетаЗаработнойПлаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
					<Comment>(Показатель 1 * Показатель 2) / 100%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разность</Name>
					<Comment>Показатель 1 - Показатель 2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтРазности</Name>
					<Comment>(Показатель 1 - Показатель 2) * Показатель 3 / 100%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произведение</Name>
					<Comment>Показатель 1 * Показатель 2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТройноеПроизведение</Name>
					<Comment>Показатель 1 * Показатель 2 * Показатель 3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Деление</Name>
					<Comment>Показатель 1 / Показатель 2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДелениеПроизведения</Name>
					<Comment>Показатель 1 * Показатель 2 / Показатель 3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинПараметр</Name>
					<Comment>Показатель 1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОдинПараметр</Name>
					<Comment>(Показатель 1) / 100%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МинимальныйОклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПараметровРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПараметровРасчетаЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучноеЗаполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйАлгоритм</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РасчетЗаработнойПлаты/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает количество параметров расчета вида начисления
//
// Параметры:
//  ВидНачисления	 - ПланыВидовРасчетаСсылка.ВидыНачислений	 - вид начисления.
// 
// Возвращаемое значение:
//  Число. 
//
Функция ПолучитьЧислоПараметровВидаНачисления(ВидНачисления) Экспорт
	
	ФормулаРасчета = ВидНачисления.ФормулаРасчета;
	Формулы = Перечисления.ФормулыРасчетаЗаработнойПлаты;
	
	Если	Не ЗначениеЗаполнено(ФормулаРасчета) Тогда
		ЧислоПараметров = 0;
	ИначеЕсли	ФормулаРасчета = Формулы.ФиксированнаяСумма
		    Или ФормулаРасчета = Формулы.МинимальныйОклад
		    Или ФормулаРасчета = Формулы.ОдинПараметр
		    Или ФормулаРасчета = Формулы.ПроцентОдинПараметр
	Тогда
		ЧислоПараметров = 1;
	ИначеЕсли	ФормулаРасчета = Формулы.Процент
			Или ФормулаРасчета = Формулы.Произведение
			Или ФормулаРасчета = Формулы.Разность
			Или ФормулаРасчета = Формулы.Деление
	Тогда
		ЧислоПараметров = 2;
	Иначе
		ЧислоПараметров = 3;
	КонецЕсли;
	
	Возврат ЧислоПараметров;
	
КонецФункции

// Оценивает значение по шкале. В составе шкалы ищется первая строка, включающая оцениваемое значение
//  и возвращается соответсвующее ей значение.
//
// Параметры:
//  ОцениваемоеЗначение	 - Число			 - значение, проверяемое по условиям состава шкалы
//  Шкала				 - СправочникСсылка.ШкалыРасчета - ссылка на шкалу оценки.
// 
// Возвращаемое значение:
//   Число.
//
/////////////////////////////////////////////////
// ОМГ
Функция ОценитьЗначениеПоШкале(ОцениваемоеЗначение, Шкала,Дата = Неопределено) Экспорт
// ОМГ
/////////////////////////////////////////////////
	
	Результат = 0;
	
	Если ТипЗнч(Шкала) = Тип("СправочникСсылка.ШкалыРасчета")
		И ТипЗнч(ОцениваемоеЗначение) = Тип("Число")
	Тогда  
	
	/////////////////////////////////////////////////
	// ОМГ
	//  
	ШкалаАктуальная = Шкала.СоставШкалы;
	Если не Дата = Неопределено тогда 
		ШкалаАктуальная = омг_РасчетЗаработнойПлатыСервер.ВернутьАктуальнуюШкалу(Шкала,Дата);
		Если ШкалаАктуальная.Количество() = 0 Тогда	
			ШкалаАктуальная = Шкала.СоставШкалы;	
		КонецЕсли
	КонецЕсли;  
	// Перебор строк шкалы в поисках первой подходящей.
	//Для Каждого СтрокаШкалы Из Шкала.СоставШкалы Цикл 
		Для Каждого СтрокаШкалы Из ШкалаАктуальная Цикл 
	// ОМГ
	/////////////////////////////////////////////////
		
					Если ОцениваемоеЗначение >= СтрокаШкалы.ЗначениеС 
			   И (ОцениваемоеЗначение <= СтрокаШкалы.ЗначениеПо Или СтрокаШкалы.ЗначениеПо = 0)
			Тогда
				Результат = СтрокаШкалы.Размер;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует таблицу данных табеля сотрудинка за период.
//
// Параметры:
//  ДатаНачала		 - Дата - дата начала периода
//  ДатаОкончания	 - Дата - дата конца периода
//  Сотрудники		 - СправочникСсылка.Сотрудники	 - сотрудник.
//  Филиал			 - СправочникСсылка.Филиалы		 - филиал расчета.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - .
//
Функция ПолучитьДанныеТабеляСотрудинков(ДатаНачала, ДатаОкончания, Сотрудники, Филиал = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремени.Сотрудник КАК Сотрудник,
	|	ТабельУчетаРабочегоВремени.День КАК День,
	|	ВЫРАЗИТЬ(ТабельУчетаРабочегоВремени.Часы КАК ЧИСЛО) КАК КоличествоЧасовПоТабелю,
	|	ТабельУчетаРабочегоВремени.Дней КАК КоличествоДнейПоТабелю
	|ИЗ
	|	РегистрСведений.ТабельУчетаРабочегоВремени КАК ТабельУчетаРабочегоВремени
	|ГДЕ
	|	ТабельУчетаРабочегоВремени.День >= &ДатаНачала
	|	И ТабельУчетаРабочегоВремени.День <= &ДатаОкончания
	|	И ТабельУчетаРабочегоВремени.Сотрудник В ИЕРАРХИИ(&Сотрудники)
	|	И (&Филиал = НЕОПРЕДЕЛЕНО
	|			ИЛИ ТабельУчетаРабочегоВремени.Филиал = &ПустойФилиал
	|			ИЛИ ТабельУчетаРабочегоВремени.Филиал = &Филиал)";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("ПустойФилиал", Справочники.Филиалы.ПустаяСсылка());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции	

// Возвращает значние дополнительного параметра з/п по переданной структуре параметров для расчета базы начисления з/п.
//
// Параметры:
//  ПараметрыВычисления - Структура - структура параметров для расчета/поиска значения дополнительного параметра.
// 
// Возвращаемое значение:
//   Число.
//
Функция ПолучитьЗначениеДополнительногоПараметра(ПараметрыВычисления) Экспорт
	
	ПараметрРасчета = ПараметрыВычисления.ПараметрРасчета;
	
	Если ПараметрРасчета.ТипПараметра = Перечисления.ТипыПараметровРасчетаЗарплаты.ПроизвольныйАлгоритм Тогда
		
		// Дополняем параметры Вычисления допустимыми константами параметра расчёта ЗП  
		
		////////////////////////////////////////////
		// ОМГ  
		
		ПараметрСписок = ПараметрРасчета.омг_Список.Выгрузить().ВыгрузитьКолонку("ЗначениеСписка"); 
				
		Если ЗначениеЗаполнено(ПараметрРасчета.Параметры) или ПараметрСписок.Количество() > 0 Тогда
			
			КонстантыАлгоритма = Новый Структура;
			Для Каждого СтрокаКонстант Из ПараметрРасчета.Параметры Цикл
				Если ОбщегоНазначенияКлиентСервер.ИмяПараметраКорректно(СтрокаКонстант.Имя) Тогда
					КонстантыАлгоритма.Вставить(СтрокаКонстант.Имя, СтрокаКонстант.Значение);
				КонецЕсли;
			КонецЦикла;  
			Если ПараметрСписок.Количество() > 0 Тогда
				 КонстантыАлгоритма.Вставить("ПараметрСписок", ПараметрСписок);
			КонецЕсли;	
			ПараметрыВычисления.Вставить("Параметры", КонстантыАлгоритма);  
		КонецЕсли;
		// ОМГ
        ////////////////////////////////////////////
		Возврат Справочники.ПараметрыРасчетаЗП.ВыполнитьРасчетАлгоритмаПараметраРасчета(ПараметрРасчета, ПараметрыВычисления);
		
	ИначеЕсли ПараметрРасчета.ТипПараметра = Перечисления.ТипыПараметровРасчетаЗарплаты.РучноеЗаполнение Тогда
		Возврат ПолучитьЗначениеПараметраРасчетаВводимогоВручную(ПараметрРасчета, ПараметрыВычисления.Сотрудник, НачалоМесяца(ПараметрыВычисления.НачалоПериода));
	КонецЕсли;
	
КонецФункции

// Схемы ЗП указанных сотрудников, действующих в указанный период. Если конец периода не указан, то на конретную дату.
//
// Параметры:
//  НачалоПериода	 - Дата	 - начало.
//  КонецПериода	 - Дата	 - конец периода, можно без времени, например, 31.01.2024 00:00:00.
//  Сотрудники		 - Массив из СправочникСсылка.Сотрудники - сотрудники.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - действующие заданный в период начисления.
//
//////////////////////////////////////////////////////////
// омг
Функция ПолучитьСхемыЗП(Знач Сотрудники, НачалоПериода, Знач КонецПериода = Неопределено, ТолькоПерсональныеНачисления = Ложь,Филиал = Неопределено, Организация = Неопределено) Экспорт
// омг	
//////////////////////////////////////////////////////////
	
	Если КонецПериода = Неопределено Тогда
		КонецПериода = НачалоПериода;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если ТолькоПерсональныеНачисления Тогда
		Запрос.УстановитьПараметр("СписокСотрудниковСИерархией", Сотрудники);
	Иначе
		СотрудникиИерархия = ПолучитьСписокСотрудниковСИерархией(Сотрудники);
		Запрос.УстановитьПараметр("СписокСотрудниковСИерархией", СотрудникиИерархия);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////
	// омг 
	
	омг_УсловиеФилиал = "";
	
	Если не Организация = Неопределено и не Организация = Справочники.Организации.ПустаяСсылка()  Тогда
		
		МассивФилиалов = омг_РасчетЗаработнойПлатыСервер.ВернутьФилиалыПоОрганизации(Организация);
		
		омг_УсловиеФилиал = " И СведенияОНачисленияхСотрудников.Филиал В(&Филиалы)";
        Запрос.УстановитьПараметр("Филиалы",МассивФилиалов);

	ИначеЕсли не Филиал = Неопределено и не Филиал = Справочники.Филиалы.ПустаяСсылка() Тогда
		
		омг_УсловиеФилиал = " И СведенияОНачисленияхСотрудников.Филиал = &Филиал";
        Запрос.УстановитьПараметр("Филиал",Филиал);

	КонецЕсли;	
	
	// омг	
	//////////////////////////////////////////////////////////

	Запрос.УстановитьПараметр("КонецПериода"	 ,КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Изменить"		 ,Перечисления.ВидыДействияСНачислением.Изменить);
	Запрос.УстановитьПараметр("НеИзменять"		 ,Перечисления.ВидыДействияСНачислением.НеИзменять);
	Запрос.УстановитьПараметр("Прекратить"		 ,Перечисления.ВидыДействияСНачислением.Прекратить);
	Запрос.УстановитьПараметр("ПрекратитьСочетание",Перечисления.ВидыДействияСНачислением.ПрекратитьСочетание);
	
	// Назначенные начисления: выборка из базы
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОНачисленияхСотрудников.Период КАК Период,
	               |	СведенияОНачисленияхСотрудников.Сотрудник КАК Сотрудник,
	               |	СведенияОНачисленияхСотрудников.Сотрудник КАК Владелец,
	               |	СведенияОНачисленияхСотрудников.Начисление КАК Начисление,
	               |	СведенияОНачисленияхСотрудников.Действие КАК Действие,
	               |	СведенияОНачисленияхСотрудников.Параметр1 КАК Параметр1,
	               |	СведенияОНачисленияхСотрудников.Параметр2 КАК Параметр2,
	               |	СведенияОНачисленияхСотрудников.Параметр3 КАК Параметр3,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодПрекращения,
	               |	ВЫБОР
	               |		КОГДА СведенияОНачисленияхСотрудников.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ СведенияОНачисленияхСотрудников.Сотрудник.ЭтоГруппа
	               |	КОНЕЦ КАК СотрудникЭтоГруппа,
	               |	ВЫБОР
	               |		КОГДА СведенияОНачисленияхСотрудников.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |				ИЛИ СведенияОНачисленияхСотрудников.Сотрудник.ЭтоГруппа
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Персональное,
	               |	СведенияОНачисленияхСотрудников.Регистратор КАК Регистратор,
	               |	СведенияОНачисленияхСотрудников.ТрудоваяРоль КАК ТрудоваяРоль,
	               |	СведенияОНачисленияхСотрудников.Начисление.ФормулаРасчета КАК ФормулаРасчета,
	               |	СведенияОНачисленияхСотрудников.Начисление.ИсточникБазы КАК ИсточникБазы,
	               |	СведенияОНачисленияхСотрудников.Начисление.ПорядокРасчета КАК ПорядокРасчета
	               |ИЗ
	               |	РегистрСведений.СведенияОНачисленияхСотрудников КАК СведенияОНачисленияхСотрудников
	               |ГДЕ
	               |	НЕ СведенияОНачисленияхСотрудников.Действие В (&Прекратить, &ПрекратитьСочетание)
	               |	И СведенияОНачисленияхСотрудников.Сотрудник В(&СписокСотрудниковСИерархией)
	               |	И СведенияОНачисленияхСотрудников.Период <= &КонецПериода
				   |"
				   //////////////////////////////////////////////////////////
				   // омг 
	                +омг_УсловиеФилиал+
				   // омг	
				   //////////////////////////////////////////////////////////
				   "
				   |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	ТрудоваяРоль,
	               |	Начисление,
	               |	Период";
	ТаблицаНачисленийИсх = Запрос.Выполнить().Выгрузить();
	
	// Прекращенные начисления: выборка из базы
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОНачисленияхСотрудников.Период КАК Период,
	               |	СведенияОНачисленияхСотрудников.Сотрудник КАК Сотрудник,
	               |	СведенияОНачисленияхСотрудников.Начисление КАК Начисление,
	               |	СведенияОНачисленияхСотрудников.Параметр1 КАК Параметр1,
	               |	СведенияОНачисленияхСотрудников.Параметр2 КАК Параметр2,
	               |	СведенияОНачисленияхСотрудников.Параметр3 КАК Параметр3,
	               |	ВЫБОР
	               |		КОГДА СведенияОНачисленияхСотрудников.Действие = &Прекратить
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПолноеПрекращение,
	               |	СведенияОНачисленияхСотрудников.ТрудоваяРоль КАК ТрудоваяРоль
	               |ИЗ
	               |	РегистрСведений.СведенияОНачисленияхСотрудников КАК СведенияОНачисленияхСотрудников
	               |ГДЕ
	               |	СведенияОНачисленияхСотрудников.Действие В (&Прекратить, &ПрекратитьСочетание)
	               |	И СведенияОНачисленияхСотрудников.Сотрудник В (&СписокСотрудниковСИерархией)
	               |	И СведенияОНачисленияхСотрудников.Период <= &КонецПериода 
				   //////////////////////////////////////////////////////////
				   // омг
				   |"
	                +омг_УсловиеФилиал+ 
					"
				   // омг	
				   //////////////////////////////////////////////////////////
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	ПрекращенияНачислений = Запрос.Выполнить().Выгрузить();
	ОтборПолное		 = Новый Структура("ПолноеПрекращение, Сотрудник, Начисление, ТрудоваяРоль", Истина);
	ТипЧисло = Тип("Число");
	
	// Расстановка периодов прекращения для изменявшихся начислений.
	Для Каждого Строка Из ТаблицаНачисленийИсх Цикл
		
		ОтборСочетание = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ОтборПолное);
		ОтборСочетание.ПолноеПрекращение = Ложь;
		Для Сч = 1 По 3 Цикл
			Если ТипЗнч(Строка["Параметр" + Сч]) <> Тип("Число") Тогда
				ОтборСочетание.Вставить("Параметр" + Сч);
			КонецЕсли;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ОтборПолное,	 Строка);
		ЗаполнитьЗначенияСвойств(ОтборСочетание, Строка);
		
		ОтборИзменение = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ОтборСочетание);
		ОтборИзменение.Удалить("ПолноеПрекращение");
		
		// Перебор способов прекращения.
		МассивПрекращений = Новый Массив;
		МассивПрекращений.Добавить(ПрекращенияНачислений.НайтиСтроки(ОтборПолное));
		МассивПрекращений.Добавить(ПрекращенияНачислений.НайтиСтроки(ОтборСочетание));
		МассивПрекращений.Добавить(ТаблицаНачисленийИсх. НайтиСтроки(ОтборИзменение));
		
		Для Каждого СтрокиВариантаПрекращения Из МассивПрекращений Цикл
		
			Для Каждого Прекращение Из СтрокиВариантаПрекращения Цикл
				Если Строка <> Прекращение // Не сравнивать строку с собою же
					И Прекращение.Период > Строка.Период
					И (Прекращение.Период < Строка.ПериодПрекращения Или Не ЗначениеЗаполнено(Строка.ПериодПрекращения))
				Тогда
					Строка.ПериодПрекращения = Прекращение.Период;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Простановка даты прекращения по умолчанию.
	Для Каждого Строка из ТаблицаНачисленийИсх Цикл
		Если ЗначениеЗаполнено(Строка.ПериодПрекращения) Тогда
			Строка.ПериодПрекращения = Строка.ПериодПрекращения - 1;
		Иначе
			Строка.ПериодПрекращения = Дата(3000,1,1);
		КонецЕсли;
	КонецЦикла;
	
	// Развёртка групп сотрудников до сотрудников
	ТаблицаНачислений = ТаблицаНачисленийИсх.СкопироватьКолонки();
	ТаблицаНачислений.Колонки.Удалить("СотрудникЭтоГруппа");
	Для Каждого Строка Из ТаблицаНачисленийИсх Цикл
		
		// Исключение уже отмененных к началу заданного периода.
		Если ЗначениеЗаполнено(Строка.ПериодПрекращения)
			И Строка.ПериодПрекращения < НачалоПериода // Строго меньше, т.к. уже посдтавлен конец прошлого дня к дате отмены.
		Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.СотрудникЭтоГруппа Тогда
			Выб = Справочники.Сотрудники.Выбрать(Строка.Сотрудник);
			Пока Выб.Следующий() Цикл
				Если Не Выб.ЭтоГруппа
					И Сотрудники.Найти(Выб.Ссылка) <> Неопределено
				Тогда
					СтрокаНачисления = ТаблицаНачислений.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНачисления,Строка);	
					СтрокаНачисления.Сотрудник = Выб.Ссылка;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЗаполнитьЗначенияСвойств(ТаблицаНачислений.Добавить(),Строка);
		КонецЕсли;
	КонецЦикла;
	
	//Запрос.Текст = " ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаНачислений ИЗ &Таб КАК Таб ГДЕ Сотрудник В ИЕРАРХИИ (&СписокСотрудников) ИЛИ Сотрудник = Значение(Справочник.Сотрудники.ПустаяСсылка)";
	//Запрос.УстановитьПараметр("Таб", ТаблицаНачислений);
	//ТаблицаНачислений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаНачислений;

КонецФункции

Функция ПолучитьВидыНачисленияОтДругихВидов() Экспорт 
	
	ВидыПараметраОтДругихНачислений = Новый Массив;
	ВидыПараметраОтДругихНачислений.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВидНачисления);
	ВидыПараметраОтДругихНачислений.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВсеНачисления);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПараметраВидНачисления", ВидыПараметраОтДругихНачислений);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ВидПараметра1	 В (&ВидПараметраВидНачисления)
	|	ИЛИ Начисления.ВидПараметра2 В (&ВидПараметраВидНачисления)
	|	ИЛИ Начисления.ВидПараметра2 В (&ВидПараметраВидНачисления)"
	;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция НачисленияЗаПериод(НачалоПериода, КонецПериода, Сотрудник, ПорядокРасчетаМакс = 10, ВидыРасчета = Неопределено, ОтборОбластьРасчета = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидыРасчета", ВидыРасчета);
	Запрос.УстановитьПараметр("ПорядокРасчетаМакс", ПорядокРасчетаМакс);
	
	Если ОтборОбластьРасчета = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияСотрудникамОбороты.Сотрудник КАК Сотрудник,
		|	НачисленияСотрудникамОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.НачисленияСотрудникам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Сотрудник = &Сотрудник
		|				И (&ВидыРасчета = НЕОПРЕДЕЛЕНО
		|					ИЛИ ВидРасчета В (&ВидыРасчета))
		|				И ВидРасчета.ПорядокРасчета <= &ПорядокРасчета) КАК НачисленияСотрудникамОбороты"
		;
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияСотрудникамОбороты.Сотрудник КАК Сотрудник,
		|	НачисленияСотрудникамОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.НачисленияСотрудникам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Сотрудник = &Сотрудник
		|				И (&ВидыРасчета = НЕОПРЕДЕЛЕНО
		|					ИЛИ ВидРасчета В (&ВидыРасчета))
		|				И ВидРасчета.ПорядокРасчета <= &ПорядокРасчета) КАК НачисленияСотрудникамОбороты
		|ГДЕ
		|	НЕ НачисленияСотрудникамОбороты.Регистратор.ПоОдномуФилиалу
		|			ИЛИ (&ОтборФилиалДокументаНачисления И &ОтборОрганизацияДокументаНачисления)";
		Если ТипЗнч(ОтборОбластьРасчета) = Тип("СправочникСсылка.Филиалы") Тогда
			Запрос.УстановитьПараметр("ОтборОрганизацияДокументаНачисления", Истина);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
										"&ОтборФилиалДокументаНачисления",
										"НачисленияСотрудникамОбороты.Регистратор.Филиал = &ОтборОбластьРасчета");
		Иначе // Организация
			Запрос.УстановитьПараметр("ОтборФилиалДокументаНачисления", Истина);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, 
										"&ОтборОрганизацияДокументаНачисления",
										"НачисленияСотрудникамОбороты.Регистратор.Филиал.Организация = &ОтборОбластьРасчета");
		КонецЕсли;
		Запрос.УстановитьПараметр("ОтборОбластьРасчета", ОтборОбластьРасчета);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначениеПараметраРасчетаВводимогоВручную(ПараметрРасчета, Сотрудник, Месяц)
	
	Запись = РегистрыСведений.ЗначенияПараметровНачислений.СоздатьМенеджерЗаписи();
	Запись.Месяц = НачалоМесяца(Месяц);
	Запись.ПараметрРасчета = ПараметрРасчета;
	Запись.Сотрудник = Сотрудник;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Значение;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокСотрудниковСИерархией(Сотрудники)
	
	Запрос = Новый Запрос;
	Запрос.Текст  =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&СписокСотрудников)
	|ИТОГИ ПО
	|	Сотрудник ТОЛЬКО ИЕРАРХИЯ";
	;
	Запрос.УстановитьПараметр("СписокСотрудников", Сотрудники);
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	ТабРезультат.Свернуть("Сотрудник","");
	
	СотрудникиИерархия = ТабРезультат.ВыгрузитьКолонку("Сотрудник");
	
//	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(СотрудникиИерархия, Справочники.Сотрудники.ПустаяСсылка());
	
	Возврат СотрудникиИерархия;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаВЗУП_СборДанных

Функция ПолучитьВыработкуНаСотрудника(СтруктураРасчета, Отбор = Неопределено) Экспорт

	Если СтруктураРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ДанныеТабеля Тогда
	
		Возврат РассчитатьПоказателиТабеля(СтруктураРасчета, Отбор);
	
	ИначеЕсли 	СтруктураРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки
			Или СтруктураРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги 
			Или СтруктураРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары
	Тогда
	
		Возврат РассчитатьСдельнуюВыработку(СтруктураРасчета, Отбор);
	
	КонецЕсли;
	
КонецФункции

Функция РассчитатьПоказателиТабеля(Структура, Отбор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремени.Сотрудник,
	|	СУММА(ТабельУчетаРабочегоВремени.Часы) КАК КоличествоЧасов,
	|	СУММА(ТабельУчетаРабочегоВремени.Дней) КАК КоличествоДней
	|ИЗ
	|	РегистрСведений.ТабельУчетаРабочегоВремени КАК ТабельУчетаРабочегоВремени
	|ГДЕ
	|	ТабельУчетаРабочегоВремени.День МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТабельУчетаРабочегоВремени.Сотрудник = &Сотрудник
	|	//%ДополнительныйОтбор
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабельУчетаРабочегоВремени.Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Структура.Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Структура.ДатаНачала));	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Структура.ДатаОкончания));
	
	Если Отбор <> Неопределено Тогда
		ТекстОтбора = "И ТабельУчетаРабочегоВремени." + Отбор.ИмяРеквизита + " = &ЗначениеОтбора";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%ДополнительныйОтбор", ТекстОтбора);
		Запрос.УстановитьПараметр("ЗначениеОтбора", Отбор.Значение);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	мсПоказатели = Новый Массив;
	Если Выборка.Следующий() Тогда
		СтруктураСотрудник = Новый Структура("Сотрудник, Сумма", Структура.Сотрудник);
		Если Структура.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю Тогда
			СтруктураСотрудник.Сумма = Выборка.КоличествоДней;
		Иначе
			СтруктураСотрудник.Сумма = Выборка.КоличествоЧасов;	
		КонецЕсли;
		мсПоказатели.Добавить(СтруктураСотрудник);
	КонецЕсли;
	
	Возврат мсПоказатели;
		
КонецФункции

Функция РассчитатьСдельнуюВыработку(СтруктураРасчета, Отбор)
	
	Результат = Новый Массив;
	
	пчПоказателиРасчета = Перечисления.ПоказателиРасчетаНачислений;
	
	// Получение текста запроса для расчета
	Если СтруктураРасчета.ПоказательРасчета		= пчПоказателиРасчета.Количество
		Или СтруктураРасчета.ПоказательРасчета	= пчПоказателиРасчета.Сумма
		Или СтруктураРасчета.ПоказательРасчета	= пчПоказателиРасчета.СуммаБезСкидок 
	Тогда
		  
		ТекстЗапроса = ПолучитьТекстЗапросаПростойСдельнойВыработки(Отбор);
		
	ИначеЕсли СтруктураРасчета.ПоказательРасчета = пчПоказателиРасчета.Себестоимость Тогда
		
		ТекстЗапроса = ПолучитьТекстЗапросаСебестоимостьСдельнойВыработкиПоПрейскуранту(Отбор);
		
	ИначеЕсли СтруктураРасчета.ПоказательРасчета = пчПоказателиРасчета.СтоимостьПоПрайсу Тогда

		ТекстЗапроса = ПолучитьТекстЗапросаВыработкаПоТарифу(Отбор);

	Иначе
		// Ошибка входных параметров
		Возврат Результат;
	КонецЕсли;		
	
	// Выполнение запроса по расчету выработки
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Сотрудник", СтруктураРасчета.Сотрудник);
	Запрос.УстановитьПараметр("ФормаУчастия", СтруктураРасчета.ФормаУчастия);
	
	Если Отбор <> Неопределено Тогда
		Запрос.УстановитьПараметр("ЗначениеОтбора", Отбор.Значение);
	КонецЕсли;
	
	Если СтруктураРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги Тогда
		Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Услуга);
		
	ИначеЕсли СтруктураРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары Тогда
		Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Материал);
		
	ИначеЕсли СтруктураРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки Тогда
		Запрос.УстановитьПараметр("ВидНоменклатуры", Неопределено);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КатегорияВыработки", СтруктураРасчета.ЗначениеПараметра);
	Запрос.УстановитьПараметр("ДатаНачала", СтруктураРасчета.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(СтруктураРасчета.ДатаОкончания));
	
	Запрос.УстановитьПараметр("ПрейскурантЗП", УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ПрейскурантРасчетаСтоимостиМатериалов"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Заполнение выходного массива
	Если 	СтруктураРасчета.ПоказательРасчета	= пчПоказателиРасчета.Количество
		Или СтруктураРасчета.ПоказательРасчета	= пчПоказателиРасчета.Сумма
		Или СтруктураРасчета.ПоказательРасчета	= пчПоказателиРасчета.СуммаБезСкидок 
	Тогда
		ИмяПоказателя = ОбщегоНазначенияПереопределяемый.ПолучитьИмяЗначенияПеречисления(СтруктураРасчета.ПоказательРасчета);
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Новый Структура("Сотрудник, Сумма", Выборка.Сотрудник, Выборка[ИмяПоказателя]));
		КонецЦикла;
	Иначе
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Новый Структура("Сотрудник, Сумма", Выборка.Сотрудник, Выборка.Сумма));	  
		КонецЦикла;
	КонецЕсли;		
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстЗапросаПростойСдельнойВыработки(Отбор)
	
	Текст = "ВЫБРАТЬ
	       	|	СУММА(ВыработкаСотрудников.СуммаОборот) КАК Сумма,
	       	|	СУММА(ВыработкаСотрудников.СуммаБезСкидокОборот) КАК СуммаБезСкидок,
	       	|	СУММА(ВыработкаСотрудников.КоличествоОборот) КАК Количество,
	       	|	ВыработкаСотрудников.Сотрудник
	       	|ИЗ
	       	|	РегистрНакопления.ВыработкаСотрудников.Обороты(
	       	|			&ДатаНачала,
	       	|			&ДатаОкончания,
	       	|			,
	       	|			Сотрудник = &Сотрудник
	       	|				И ТрудоваяРоль = &ФормаУчастия
			|				//%ДополнительныйОтбор
	       	|				И (Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	       	|					ИЛИ Номенклатура.КатегорияВыработки = &КатегорияВыработки)) КАК ВыработкаСотрудников
	       	|
	       	|СГРУППИРОВАТЬ ПО
	       	|	ВыработкаСотрудников.Сотрудник";
	
	Если Отбор <> Неопределено Тогда
		ТекстОтбора = "И " + Отбор.ИмяРеквизита + " = &ЗначениеОтбора";
		Текст = СтрЗаменить(Текст, "//%ДополнительныйОтбор", ТекстОтбора);	
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТекстЗапросаСебестоимостьСдельнойВыработкиПоПрейскуранту(Отбор)
	
	Текст = "ВЫБРАТЬ
	        |	ВыработкаСотрудниковОбороты.Сотрудник,
	        |	ВыработкаСотрудниковОбороты.Номенклатура.КатегорияВыработки,
	        |	ВыработкаСотрудниковОбороты.Номенклатура,
	        |	ВыработкаСотрудниковОбороты.ХарактеристикаНоменклатуры,
	        |	ВыработкаСотрудниковОбороты.Регистратор
	        |ПОМЕСТИТЬ НоменклатурыСотрудников
	        |ИЗ
	        |	РегистрНакопления.ВыработкаСотрудников.Обороты(
	        |			&ДатаНачала,
	        |			&ДатаОкончания,
	        |			Запись,
	        |			Сотрудник = &Сотрудник
	        |				И ТрудоваяРоль = &ФормаУчастия
			|				//%ДополнительныйОтбор1
	        |				И ТипВыработки = ЗНАЧЕНИЕ(Перечисление.ТипыВыработки.Услуги)) КАК ВыработкаСотрудниковОбороты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	РасходТМЦ.Сотрудник,
	        |	РасходТМЦ.КатегорияВыработки,
	        |	РасходТМЦ.Номенклатура,
	        |	РасходТМЦ.ХарактеристикаНоменклатуры,
	        |	РасходТМЦ.Количество,
	        |	РасходТМЦ.Период,
	        |	РасходТМЦ.Регистратор,
	        |	РасходТМЦ.РасходНаТМЦ,
	        |	РасходТМЦ.ВидНоменклатуры
	        |ПОМЕСТИТЬ РасходТМЦ
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		РасходМатериаловОбороты.Сотрудник КАК Сотрудник,
	        |		РасходМатериаловОбороты.Номенклатура.КатегорияВыработки КАК КатегорияВыработки,
	        |		РасходМатериаловОбороты.Материал КАК Номенклатура,
	        |		РасходМатериаловОбороты.ХарактеристикаМатериала КАК ХарактеристикаНоменклатуры,
	        |		РасходМатериаловОбороты.РасходФактическийОборот КАК Количество,
	        |		РасходМатериаловОбороты.Период КАК Период,
	        |		РасходМатериаловОбороты.Регистратор КАК Регистратор,
	        |		ВЫБОР
	        |			КОГДА РасходМатериаловОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	        |				ТОГДА ИСТИНА
	        |			КОГДА РасходМатериаловОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	        |				ТОГДА ЛОЖЬ
	        |			ИНАЧЕ NULL
	        |		КОНЕЦ КАК РасходНаТМЦ,
	        |		РасходМатериаловОбороты.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	        |		РасходМатериаловОбороты.Номенклатура КАК НоменклатураМатериала,
	        |		""Материалы"" КАК ТабличнаяЧасть
	        |	ИЗ
	        |		РегистрНакопления.РасходМатериалов.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Сотрудник = &Сотрудник) КАК РасходМатериаловОбороты
			|		//%ДополнительныйОтбор2
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ВыработкаСотрудниковОбороты.Сотрудник,
	        |		ВыработкаСотрудниковОбороты.Номенклатура.КатегорияВыработки,
	        |		ВыработкаСотрудниковОбороты.Номенклатура,
	        |		ВыработкаСотрудниковОбороты.ХарактеристикаНоменклатуры,
	        |		ВыработкаСотрудниковОбороты.КоличествоОборот,
	        |		НАЧАЛОПЕРИОДА(ВыработкаСотрудниковОбороты.Период, ДЕНЬ),
	        |		ВыработкаСотрудниковОбороты.Регистратор,
	        |		ИСТИНА,
	        |		ВыработкаСотрудниковОбороты.Номенклатура.ВидНоменклатуры,
	        |		NULL,
	        |		""Товары""
	        |	ИЗ
	        |		РегистрНакопления.ВыработкаСотрудников.Обороты(
	        |				&ДатаНачала,
	        |				&ДатаОкончания,
	        |				Запись,
	        |				Сотрудник = &Сотрудник
	        |					И ТрудоваяРоль = &ФормаУчастия
			|					//%ДополнительныйОтбор3
	        |					И ТипВыработки = ЗНАЧЕНИЕ(Перечисление.ТипыВыработки.Товары)) КАК ВыработкаСотрудниковОбороты) КАК РасходТМЦ
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатурыСотрудников КАК НоменклатурыСотрудников
	        |		ПО (РасходТМЦ.НоменклатураМатериала = НоменклатурыСотрудников.Номенклатура
	        |				ИЛИ РасходТМЦ.ТабличнаяЧасть = ""Товары"")
	        |			И РасходТМЦ.Регистратор = НоменклатурыСотрудников.Регистратор
	        |			И РасходТМЦ.Сотрудник = НоменклатурыСотрудников.Сотрудник
	        |ГДЕ
	        |	(РасходТМЦ.ВидНоменклатуры = &ВидНоменклатуры
	        |			ИЛИ РасходТМЦ.ВидНоменклатуры = НЕОПРЕДЕЛЕНО
	        |				И РасходТМЦ.КатегорияВыработки = &КатегорияВыработки)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЦеныНоменклатуры.Период,
	        |	ЦеныНоменклатуры.Номенклатура,
	        |	ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
	        |	МИНИМУМ(ЦеныНоменклатуры.Цена * ВЫБОР
	        |			КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент, 0) = 0
	        |				ТОГДА 1
	        |			ИНАЧЕ ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент / ЦеныНоменклатуры.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	        |		КОНЕЦ) КАК Цена
	        |ПОМЕСТИТЬ ЦеныНоменклатуры
	        |ИЗ
	        |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	        |ГДЕ
	        |	ЦеныНоменклатуры.Прейскурант = &ПрейскурантЗП
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
	        |	ЦеныНоменклатуры.Период,
	        |	ЦеныНоменклатуры.Номенклатура
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПоследниеЦены.Сотрудник,
	        |	ПоследниеЦены.Количество * ЦеныНоменклатуры.Цена КАК Сумма
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		РасходТМЦ.Сотрудник КАК Сотрудник,
	        |		РасходТМЦ.Номенклатура КАК Номенклатура,
	        |		РасходТМЦ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	        |		РасходТМЦ.Количество КАК Количество,
	        |		РасходТМЦ.Период КАК Период,
	        |		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ПериодЦены
	        |	ИЗ
	        |		РасходТМЦ КАК РасходТМЦ
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	        |			ПО РасходТМЦ.Номенклатура = ЦеныНоменклатуры.Номенклатура
	        |				И РасходТМЦ.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
	        |				И РасходТМЦ.Период >= ЦеныНоменклатуры.Период
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		РасходТМЦ.ХарактеристикаНоменклатуры,
	        |		РасходТМЦ.Номенклатура,
	        |		РасходТМЦ.Период,
	        |		РасходТМЦ.Сотрудник,
	        |		РасходТМЦ.Количество) КАК ПоследниеЦены
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	        |		ПО ПоследниеЦены.Номенклатура = ЦеныНоменклатуры.Номенклатура
	        |			И ПоследниеЦены.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
	        |			И ПоследниеЦены.ПериодЦены = ЦеныНоменклатуры.Период";
	
	
	Если Отбор <> Неопределено Тогда
		Текст = СтрЗаменить(Текст, "//%ДополнительныйОтбор1", "И " + Отбор.ИмяРеквизита + " = &ЗначениеОтбора");
		Текст = СтрЗаменить(Текст, "//%ДополнительныйОтбор2", "ГДЕ РасходМатериаловОбороты.Регистратор." + Отбор.ИмяРеквизита + " = &ЗначениеОтбора");
		Текст = СтрЗаменить(Текст, "//%ДополнительныйОтбор3", "И " + Отбор.ИмяРеквизита + " = &ЗначениеОтбора");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТекстЗапросаВыработкаПоТарифу(Отбор)
	
	Текст = "ВЫБРАТЬ
	        |	ВыработкаСотрудниковОбороты.Период КАК Дата,
	        |	ВыработкаСотрудниковОбороты.Сотрудник,
	        |	ВыработкаСотрудниковОбороты.Номенклатура,
	        |	ВыработкаСотрудниковОбороты.ХарактеристикаНоменклатуры,
	        |	ВыработкаСотрудниковОбороты.КоличествоОборот
	        |ПОМЕСТИТЬ Выработка
	        |ИЗ
	        |	РегистрНакопления.ВыработкаСотрудников.Обороты(
	        |			&ДатаНачала,
	        |			&ДатаОкончания,
	        |			День,
	        |			Сотрудник = &Сотрудник
	        |				И ТрудоваяРоль = &ФормаУчастия
	        |				И (Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
			|				//%ДополнительныйОтбор1
	        |					ИЛИ Номенклатура.КатегорияВыработки = &КатегорияВыработки)) КАК ВыработкаСотрудниковОбороты
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЦеныНоменклатуры.Период,
	        |	ЦеныНоменклатуры.Номенклатура,
	        |	ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
	        |	МИНИМУМ(ЦеныНоменклатуры.Цена * ВЫБОР
	        |			КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент, 0) = 0
	        |				ТОГДА 1
	        |			ИНАЧЕ ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент / ЦеныНоменклатуры.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	        |		КОНЕЦ) КАК Цена
	        |ПОМЕСТИТЬ ЦеныНоменклатуры
	        |ИЗ
	        |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	        |ГДЕ
	        |	ЦеныНоменклатуры.Прейскурант = &ПрейскурантЗП
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
	        |	ЦеныНоменклатуры.Период,
	        |	ЦеныНоменклатуры.Номенклатура
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЦеныПоследние.Сотрудник,
	        |	СУММА(ЦеныПоследние.КоличествоОборот * ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)) КАК Сумма
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		Выработка.Дата КАК Дата,
	        |		Выработка.Сотрудник КАК Сотрудник,
	        |		Выработка.Номенклатура КАК Номенклатура,
	        |		Выработка.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	        |		Выработка.КоличествоОборот КАК КоличествоОборот,
	        |		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	        |	ИЗ
	        |		Выработка КАК Выработка
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	        |			ПО Выработка.Дата >= ЦеныНоменклатуры.Период
	        |				И Выработка.Номенклатура = ЦеныНоменклатуры.Номенклатура
	        |				И Выработка.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		Выработка.Номенклатура,
	        |		Выработка.Дата,
	        |		Выработка.Сотрудник,
	        |		Выработка.ХарактеристикаНоменклатуры,
	        |		Выработка.КоличествоОборот) КАК ЦеныПоследние
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	        |		ПО ЦеныПоследние.Номенклатура = ЦеныНоменклатуры.Номенклатура
	        |			И ЦеныПоследние.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
	        |			И ЦеныПоследние.Период = ЦеныНоменклатуры.Период
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЦеныПоследние.Сотрудник";
	
	Если Отбор <> Неопределено Тогда
		Текст = СтрЗаменить(Текст, "//%ДополнительныйОтбор1", "И " + Отбор.ИмяРеквизита + " = &ЗначениеОтбора");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти
